#include "DxLib.h"
#include "Scene.h"
#include "SceneGameOver.h"
#include "../Input/Input.h"

//==================================
//　ゲームオーバー背景画像のパス
//==================================
#define BG_GAMEOVER_PATH	"Data/BgGameOver.png"

//==================================
//　ゲームオーバー画像のハンドル
//==================================
int bgGameOverHandle;


//==================================
//	ゲームオーバー初期化
//==================================
void InitGameOver()
{
	//==================================
	//　ゲームオーバー背景初期化
	//==================================
	bgGameOverHandle = LoadGraph(BG_GAMEOVER_PATH);

	//==================================
	//　ゲームオーバーループへ
	//==================================
	g_CurrentSceneID = SCENE_ID_LOOP_GAMEOVER;
}

//==================================
//	ゲームオーバー通常処理
//==================================
void StepGameOver()
{

	//==================================
	//　EnterキーかZ押されたなら
	//==================================
	if (IsKeyPush(KEY_INPUT_RETURN) == 1 || IsKeyPush(KEY_INPUT_Z) == 1)
	{
		//==================================
		//　ゲームオーバー後処理へ移動
		//==================================
		g_CurrentSceneID = SCENE_ID_FIN_GAMEOVER;//プレイシーンのID

	}
}

//==================================
//	ゲームオーバー描画処理
//==================================
void DrawGameOver() {
	//==================================
	//	ゲームオーバー描画処理
	//==================================
	DrawGraph(0, 0, bgGameOverHandle, true);
}

//==================================
//	ゲームオーバー描画処理
//==================================
void FinGameOver() {
	//==================================
	//	ゲームオーバー画像破棄
	//==================================
	DeleteGraph(bgGameOverHandle);
	//==================================
	//	タイトルシーン初期化へ
	//==================================
	g_CurrentSceneID = SCENE_ID_INIT_TITLE;
}
